insert into t_plan (name,introduction,info,course_id) VALUES ('Java','##### JAVA专业时长：


线上课程合计25周，约6个月时间。涵盖了很多新增高级技术、高级框架项目、分布式项目、微服务架构项目等。不止用于学员就业、也可用于学员工作1-3年内的提升。


##### 就业节点：


学员学习到22周（5个月）时，其实就可以就业。如果想实现更高质量就业，继续学完后再开始就业。


##### 学习时间：


由于百战灵活的学习模式，学员可以全职学习或者利用业余时间开展学习。由于个人能力和基础的差异，时间不同，以做完当天任务为准。


##### 课程更新：


监督并发学习计划。


##### 班主任监管：


班主任都会进行线上辅导，督促学习，克服拖延症。','| 第01周 预科和入门            | 周一：预科阶段(程序员基本素养、JAVA技术体系、就业和找工作要点) 周二：JAVA入门和开发环境配置 周三：变量和数据类型 周四：IDEA的使用 周五：第一个java小游戏项目 周末：提交学习心得和作业 |
| --------------------------------------- | ------------------------------------------------------------ |
| 第02周 控制语句             | 周一：if、switch(开关)语句、while、for循环 周二：嵌套循环、break(打破)、continue(继续)语句 周三：控制语句深入练习 周四：方法 周五：递归算法 周末：提交作业 |
| 第03周 面向对象和JVM底层内存分析     | 周一：对象和类的基本知识 周二：JVM底层内存分析、垃圾回收机制和JVM内存模型 周三：JVM底层分析深化、this、static、package、import(进口) 周四：继承、方法重写、Object(对象)类 周五：封装、访问控制符、多态、final 周末：提交作业 |
| 第04周 面向对象收尾和数组        | 周一：抽象类、接口、内部类 周二：面向对象回顾总结 周三：数组初步和内存分析 周四：数组深化、二维数组 周五：冒泡算法、优化冒泡、二分法 周末：提交作业 |
| 第05周 项目开发(数组和飞机小项目)    | 周一：游戏主窗口、飞机类设计 周二：键盘控制飞机八个方向 周三：炮弹类设计、双缓冲、矩阵检测、碰撞检测 周四：爆炸类、数组轮播、计时功能 周五：异常机制 周末：提交作业 |
| 第06周 常用类和容器           | 周一：包装类、字符串（String(字符串)/StringBuilder/StringBuffer） 周二：时间相关类、File、枚举 周三：泛型、List(列表)接口、ArrayList、LinkedList、Vector(向量)的用法和底层实现 周四：Map接口、HashMap用法和底层实现分析 周五：Set接口、HashSet用法和底层实现分析、迭代器、Collections(集合)用法 周末：提交作业 |
| 第07周 IO流、多线程、网络编程      | 周一：IO流 周二：序列化和反序列化、设计模式（装饰器模式）、Apache IOUtils和FileUtils 周三：多线程基本知识 周四：死锁、同步、线程协作、生产者和消费者模式、任务定时调度 周五：网络编程（TCP通讯、UDP通讯） 周末：提交作业 |
| 第08周 XML、反射机制、并发编程      | 周一：XML技术、XML数据解析 周二：反射原理、Class对象和用法 周三：注解、反射读取注解 周四：并发编程模型、JAVA内存模型、线程同步和通讯、锁机制、 周五：阻塞队列、线程池、ThreadLocal 周末：提交作业 |
| 第09周 项目开发（手写WEB服务器）     | 周一：网络编程回顾、多线程实现聊天室代码 周二：HTML入门、HTTP协议入门、Tomcat服务器快速使用、http查看工具 周三：手写服务器_整体架构和接口、Response、Request 周四：Request储存参数和处理中文、分发器 周五：多请求处理（多态、反射）、XML文件配置和解析 周末：提交作业 |
| 第10周 数据库和SQL语言          | 周一：Mysql、Oracle(甲骨文)安装以及相关客户端 周二：SQL语言基础、select(选择)查询、where、orderby、group by、having分 周三：DML、外连接、数据库表和约束条件 周四：子查询、序列、索引、视图、事务 周五：rowid和rownum、分页查询、面试题中的SQL语句 |
| 第11周 数据库设计范式_JDBC查询      | 周一：数据库设计三范式 周二：数据库表的设计 周三：JDBC数据库连接的基本用法(PreparedStatement/ResultSet) 周四：事务处理、时间处理、Clob和Blob大对象 周五：ORM基本原理、Apache DBUtils的使用 |
| 第12周 网页编程和设计          | 周一：HTML5基础、CSS3基础 周二：JavaScript基础 周三：DOM对象处理 周四：Jquery基础 周五：Vue基础 |
| 第13周 JAVAEE服务器编程 Ajax       | 周一：Serlvet入门（Tomcat服务器、Request、Response） 周二：Servlet入门（Session(会话)、Cookie、Context(上下文)、Config） 周三：JSP基础和JSTL标签库 周四：AJAX技术 周五：注册和登录项目综合练习 |
| 第14周 Mybatis框架的使用         | 周一：Mybatis环境搭建和映射文件 周二：查询实现 周三：缓存和动态SQL 周四：Mybatis运行核心原理和常用注解 周五：使用Mybatis实现单表和多表的增删改查 周末：提交作业 |
| 第15周 SSM框架              | 周一：spring 框架入门、IOC 周二：AOP面向切面等 周三：spring MVC 周四：spring MVC 周五：SSM框架整合（Mybatis在数据库阶段讲过） |
| 第16周 项目开发（RBAC角色权限管理项目） | 周一：RBAC基于角色的权限管理项目原型和数据库设计 周二：用户管理模块 周三：角色管理模块 周四：权限管理模块 周五：后台超级管理员模块和功能扩展 周末：继续完成项目，并提交项目作业 |
| 第17周 JAVA高级技术           | 周一：shiro 周二：Linux系统操作基础 周三：Maven 周四：Dubbo 周五：VSFTPD、Nginx |
| 第18周 JAVA高级技术           | 周一：Solr 周二：ActiveMQ 周三：Jsonp、HttpClient、MyCat 周四：SOA架构、电商项目整体架构 周五：使用VSFTPD和Nginx完成商品新增 |
| 第19周 分布式、高并发电商项目      | 周一：基于json格式完成商品规格参数管理 周二：使用jsonp完成首页导航菜单 周三：完成CMS系统 周四：基于solr完成商品搜索功能 周五：SSO单点登录系统 |
| 第20周 分布式、高并发电商项目      | 周一：购物车及复杂功能的实现 周二：订单系统实现 周三：ActiveMQ消息队列以及订单系统管理 周四：Mysql读写分离、分库分表 周五：电商项目部署到Linux服务器、配置虚拟域名、测试 |
| 第21周 spring全家桶           | 周一：spring boot(引导) 框架 周二：spring boot(引导) 框架 周三：spring boot(引导) 框架 周四：spring data 数据操作 周五：spring cloud 微服务架构 |
| 第22周 spring全家桶           | 周一：spring cloud微服务架构 周二：spring cloud微服务架构 周三：spring cloud微服务架构 周四：spring session(会话) 周五：spring session(会话) |
| 第23周 微服务架构项目          | 百战商城项目（基于spring cloud架构）             |
| 第24周 微服务架构项目          | 百战商城项目（基于spring cloud架构）             |
| 第25周 就业辅导周            | 周一：面试技巧 周二：笔试题汇总 周三：简历1对1辅导、简历投递技巧 周四：入职后如何快速成长到CTO、职场软实力 周五：毕业典礼 |',1);


insert into t_plan (name,introduction,info,course_id) VALUES ('Python','##### Python专业时长：


线上课程合计5.5个月


##### 课程更新：


监督并发学习计划。


##### 班主任监管：


班主任都会进行线上辅导，督促学习，克服拖延症。','| 第01周 Python入门                 | 周一: Python入门 周二: 编程基本概念 周三：序列 周四：控制语句 周五：函数 周末：提交学习心得和作业 |
| ------------------------------------------------- | ------------------------------------------------------------ |
| 第02周 Python深入学习               | 周一：面向对象编程 周二：Python开发环境搭建 周三：异常处理 周四：文件处理 周五：模块 周末：提交学习心得和作业 |
| 第03周 Python深入学习               | 周一：GUI编程 周二：GUI编程 周三：游戏开发-坦克大战 周四：游戏开发-坦克大战 周五：并发编程 周末：提交学习心得和作业 |
| 第04周 Python 核心特性               | 周一：并发编程 周二：网络通信 周三：生成器和装饰器 函数式编程 周四：正则表达式 内存管理 周五：mysql介绍与环境安装 周末：提交学习心得和作业 |
| 第05周 数据库编程                 | 周一：数据库和字段的创建_删除_修改和约束 周二：数据插入_修改_删除、数据类型及排序 周三：模糊查询_多条件查询_分页查询_函数 周四：多表查询_子查询 周五：视图_索引_事务 周末：提交学习心得和作业 |
| 第06周 Linux 环境编程基础 网页编程基础       | 周一：范式_Python操作MySQL数据_音乐播放项目 周二：Linux 环境编程基础 周三：html基本标签_html5 周四：css引入方式_css选择器 周五：css定位_css盒子模型_css常用属性 周末：提交学习心得和作业 |
| 第07周 网页编程基础                | 周一：css项目搭建 周二：JavaScript引入方式_JavaScript流程控制语句_函数 周三：JavaScript中DOM编程 周四：JavaScript表单验证_案例制作购物车页面 周五：jQuery选择器_jQuery操作页面 周末：提交学习心得和作业 |
| 第08周 vue框架                   | 周一：jQuery事件_jQuery案例 周二：Ajax 周三：vue环境搭建_vue基础知识 周四：vue路由_vue插件_vue打包部署 周五：虚拟环境_Flask项目搭建_URL与函数映射 周末：提交学习心得和作业 |
| 第09周 Flask框架                  | 周一：自定义URL转换器_页面跳转和重定向 周二：URL传递参数_自定义URL转换器_视图函数 周三：Jinja2模版_Jinja2过滤器 周四：控制语句_宏_模版继承 周五：Flask视图高级 周末：提交学习心得和作业 |
| 第10周 Flask高级 Flask数据库            | 周一：Cookie和Session(会话)的使用 周二：ThreadLocal变量_Flask_钩子函数 周三：Flask_内置信号_WTForms 周四：Flask_RESTful的使用 周五：SQLAlchemy对数据的增删改查操作 周末：提交学习心得和作业 |
| 第11周 Flask数据库 Flask百战电商后台项目      | 周一：ORM层面对应关系实现_高级查询之子查询 周二：Flask-SQLAlchemy的使用_Flask项目结构重构 周三：(后端)VSCode创建Flask项目_用户注册、登录操作 周四：vue创建项目_ES6的规范介绍_(前端)登录操作 周五：(前端)菜单的展示_对用户信息的获取、更新、删除 周末：提交学习心得和作业 |
| 第12周 Flask百战电商后台项目            | 周一：(前端)用户列表布局_(前端)重置密码实现 周二：权限功能实现 周三：商品列表的开发 周四：类参数_类管理 周五：商品管理 周末：提交学习心得和作业 |
| 第13周 Flask百战电商后台项目 Tornado(龙卷风) 框架 | 周一：图片上传_预览_商品添加前后端结合 周二：订单管理_数据统计 周三：Tornado(龙卷风)简介_第一个Tornado(龙卷风)程序 周四：Template的使用_UIModule的使用 周五：个人信息案例 周末：提交学习心得和作业 |
| 第14周 Tornado(龙卷风)项目 Django初级       | 周一：项目介绍_项目结构的搭建 周二：用户注册_用户登录_修改个人信息 周三：帖子、评论、关注功能的开发 周四：项目搭建_URLConf调度器 周五：模型-项目中应用 周末：提交学习心得和作业 |
| 第15周 Django初级                 | 周一：视图 周二：模板django引擎 周三：admin后台管理 周四：会话技术 周五：页器-:页栏页码实现 周末：提交学习心得和作业 |
| 第16周 Django进阶                 | 周一：web请求生命周期 周二：验证码_中间件 周三：日志-项目实践 周四：信号signals_缓存redis 周五：Celery 周末：提交学习心得和作业 |
| 第17周 Django高级                 | 周一：REST framework-请求方法 周二：REST framework-序列化 周三：REST framework-请求和响应、基于类的视图 周四：REST framework-身份验证和权限管理、JWT 周五：REST framework-xadmin、节流控制、版本控制 周末：提交学习心得和作业 |
| 第18周 Django高级                 | 周一：项目部署 周二：项目部署nginx学习 周三：文件云存储_富文本DjangoUeditor 周四：文件上传和下载_项目开发流程 周五：邮箱验证和短信验证 周末：提交学习心得和作业 |
| 第19周 大型电商项目                | 周一：Git 周二：商品首页_商品详情功能 周三：用户模块 周四：购物车_结算 周五：商品支付功能_项目部署 周末：提交学习心得和作业 |
| 第20周 自动化操作办公软件、邮件、定时任务     | 周一：excel(出类拔萃)的基本操作 周二：word的基本操作 周三：pdf、ppt的基本操作 周四：发送邮件、定时任务、钉钉消息 周五：压缩文件的操作_压缩包密码破解 周末：提交学习心得和作业 |
| 第21周 Python 爬虫开发               | 周一：爬虫介绍与常用工具 周二：爬虫开发常用模块 周三：数据提取与验证码识别 周四：scrapy 框架 周五：爬虫数据存储_动态数据抓取 周末：提交学习心得和作业 |
| 第22周 Python 爬虫开发 算法与数据结构       | 周一：布式爬虫 周二：docker 容器扩展 周三：单链表_双链表_队列 周四：哈希表_哈希表冲突_哈希扩容_递归与栈 周五：常用排序_树结构与遍历_二叉树 周末：提交学习心得和作业 |
| 第23周 数据分析-数据可视化             | 周一：matplotlib 周二：seaborn 周三：pyecharts 周四：pyecharts 周五：Anaconda环境搭建_jupyter notebook(笔记本)的使用 周末：提交学习心得和作业 |
| 第24周 数据分析-数据管理              | 周一：numpy数组创建_命令使用 周二：numpy数组索引、切片、函数 周三：pandas数据初始化及保存 周四：pandas索引、数据获取、数据合并 周五：pandas缺失值处理、pandas_时间索引应用、pandas_绘图、pandas_大数据文件处理 周末：提交学习心得和作业 |
| 第25周 数据分析-数据管理 Python统计分析      | 周一：足球运动员数据分析 周二：电影数据分析_机场延迟分析 周三：Python统计分析 周四：Python统计分析 周五：Python统计分析 周末：提交学习心得和作业 |
| 第26周 Python_数据分析项目             | 周一：人工智能项目流程_二手车价格预测 周二：旅游景点票价预测_工资分类预测 周三：广告点击转化率预测_文本分类-自然语言处理 周四：音乐推荐系统 周五：银行客户流失分析_申请评分卡 周末：提交学习心得和作业 |',2);


insert into t_plan (name,introduction,info,course_id) VALUES ('Web前端','##### Web前端专业时长：


线上课程合计5.5个月。


##### 课程更新：


监督并发学习计划。


##### 班主任监管：


班主任都会进行线上辅导，督促学习，克服拖延症。','| 第01周 环境搭建与HTML标签   | 周一:环境搭建与了解WEB前端 周二:HTML骨架与基本标签 周三：HTML常用基础标签 周四：文本与列表 周五：HTML表格 |
| ----------------------------- | ------------------------------------------------------------ |
| 第02周 HTML标签续与H5新增标签 | 周一：HTML表单 周二：HTML属性 周三：实体与内联框架 周四：视频与音频 周五：语义化标签 |
| 第03周 样式表与选择器     | 周一：CSS引入方式与基础样式 周二：CSS基础选择器 周三：背景与相关属性 周四：字体与相关属性 周五：关系和伪类选择器 |
| 第04周 选择器深入与盒子模型  | 周一：div+css布局 周二：css3新选择器 周三：标准盒子模型 周四：IE盒子模型与练习 周五：弹性盒子模型 |
| 第05周 浮动与定位       | 周一：float(漂浮)浮动与清除浮动 周二：position(位置)定位 周三：display(显示)属性 周四：导航与轮播实战 周五：过渡与动画 |
| 第06周 媒体查询与实战     | 周一：媒体查询与PS 周二：css优化与字体库 周三：H5设计站点实战 周四：兼容性站点实战 周五：响应式站点实战 |
| 第07周 变量与运算符语句    | 周一：JS介绍与变量 周二：数据类型与基本运算符 周三：运算符与实例操作 周四：分支与循环语句 周五：string(字符串)字符串 |
| 第08周 函数与对象       | 周一：数组 周二：函数、作用域 周三：对象、按值传递 周四：DOM基础操作 周五：DOM基础操作2 |
| 第09周 DOM操作与事件      | 周一：Document(文档)节点与DOM树 周二：DOM节点的创建添加与移除 周三：HTML事件、DOM0级事件、DOM2级事件、事件兼容 周四：事件类型分类 周五：事件委托与联动应用 |
| 第10周 BOM与闭包原理      | 周一：DOM与BOM关系 周二：window对象 周三：闭包结构、原理、实现 周四：闭包应用 周五：this、自执行函数 |
| 第11周 面向对象        | 周一：类、对象、构造函数 周二：封装、实例对象 周三：原型与原型链 周四：继承、MVC、MVVM 周五：工厂模式、原型模式、构造函数模式、组合模式、观察者模式 |
| 第12周 正则、算法与解析    | 周一：正则修饰符、表达式 周二：正则匹配规则 周三：递归、冒泡、快速、插入排序 周四：数组去重、拷贝、深度拷贝 周五：json解析与实战 |
| 第13周 jQuery类库与常用框架  | 周一：jQuery基础、事件、动画 周二：jQuery节点、DOM操作 周三：jQuery源码分析，扩展 周四：Bootstrap UI框架应用 周五：Swiper UI框架应用 |
| 第14周 PHP与数据库编程     | 周一：PHP语法、数组、函数 周二：PHP类、对象、构造函数 周三：mysql增删改查 周四：pdo、事务 周五：文章增删改查 |
| 第15周 Http服务与Ajax编程   | 周一：时间戳、ajax实例化、get请求、post(后)请求、json文件 周二：封住Ajax 周三：Ajax实战 周四：跨域、jsonp，cors 周五：封装跨域、字符串模板、分页 |
| 第16周 音乐社区项目      | 周一：div+css布局 周二：头像上传、三级联动 周三：扩展jQuery插件 周四：富文本编辑器 周五：拆分整合与优化代码 |
| 第17周 H5新特性与移动端    | 周一：本地存储、cookie、webWorker、File API 周二：canvas(帆布)绘图 周三：flappyBird游戏开发 周四：地图、Echarts 周五：移动端适配、REM、Flex、兼容性 |
| 第18周 高级框架Angularjs    | 周一：体验Angular(转角)、变量、双向数据绑定 周二：控制器、事件、基本指令 周三：服务、自定义指令、广播 周四：内置路由与routerui 周五：Angular(转角)实战演练 |
| 第19周 模块化与Nodejs     | 周一：基本模块、放大模式、私有与公有属性、插件安装 周二：模块化、require(需要)、seajs、模块化实战 周三：Node环境搭建、创建服务、事件、输入与输出、进制转化 周四：express(表达)框架、路由、中间件 周五：get请求、post(后)请求、携带参数 |
| 第20周 Node、ES6与构建工具   | 周一：Node链接数据库、数据库搭建、过滤数据、koa 周二：构建完整Node服务器端、模拟数据、解决跨域 周三：Babel、Let(让)与Const、字符串、数组、对象、函数扩展 周四：类与集成、Promise(承诺)、其他新特性 周五：Less(少)、Sass、Gulp(吞掉)、Grunt、热更新 |
| 第21周 Git、SVN、Webpack    | 周一：SVN安装、资源库、上传与下载、项目管理、版本迭代、解决冲突 周二：Git环境搭建、提交、回退、分支、冲突、多人协作、上传、github与码云管理代码 周三：webpack环境搭建、配置文件、服务器搭建、loaders 周四：webpack插件、webpack打包 周五：webpack构建React(反应)环境、webpack版本迭代 |
| 第22周 高级框架React(反应)   | 周一：React(反应)介绍、jsx语法、组件化 周二：props(道具)、state(状态)、组件交互 周三：组件、组件生命周期、网络请求 周四：Antd UI库、Fetch(取)网络请求 周五：React(反应) Router、嵌套、参数传递 |
| 第23周 React(反应) News    | 周一：React(反应)-News环境搭建、导航栏、登录注册UI、Antd组件应用 周二：服务器端搭建、提供接口、完善登录注册 周三：公共组件、组件交互、评论系统 周四：移动端接入、第三方插件应用、上拉加载、下拉刷新 周五：R项目测试、优化、打包 |
| 第24周 高级框架Vue       | 周一：Vue环境构建、项目结构、基本指令、事件应用、双向数据绑定 周二：组件基础、组件交互、插槽功能、组件缓存、动画效果、自定义指令、过滤器 周三：网络请求Axios、配置、跨域处理、操作原生DOM 周四：路由配置、跳转、嵌套、传递数据、高亮 周五：常用组件、swiper、element(元素)-ui、iView |
| 第25周 高级框架Vue实战     | 周一：音乐列表、歌手信息、歌曲播放 周二：搜索、上拉加载、加载等待、真机测试 周三：Vuex、store、state(状态)、getters、actions、modules(模块) 周四：PC端实战、自定义组件组件交互、订单共享 周五：优化、测试，打包 |
| 第26周 微信小程序       | 周一：小程序介绍、开发工具、wxss、事件、跳转 周二：视图编辑、列表渲染、template模板 周三：参数携带、本地存储、提示框、音频、导航 周四：上拉加载、下拉刷新 周五：搜索、测试、提交审核 |',9);


insert into t_plan (name,introduction,info,course_id) VALUES ('人工智能','## 55个案例，60+算法，10个项目案例


### 培养目标


人工智能岗位中的“皇冠”：AI算法工程师！


### 课程定位


三大主流领域(计算机视觉、自然语言处理、数据挖掘)。


### 报名对象


一、大学本科、研究生、博士
二、入职1-3年，遇事业瓶颈期，能力提升
三、职场程序员转行人工智能的人员、晋升空间有限，渴望待遇提升','| 第01周 人工智能概念                      | 1. 人工智能的时代发展 2. 人工智能的应用场景 3. 机器学习流程与本质 4. 机器学习与深度学习 5. 回归、分类、聚类、降维 |
| ------------------------------------------------------------ | ------------------------------------------------------------ |
| 第02周 Python科学计算                     | 1. Python基础语法 2. 科学计算模块Numpy 3. 数据处理分析模块Pandas 4. 数据可视化模块 |
| 第03周 AI数学知识                       | 1. 一元函数微分学 2. 线性代数基础 3. 多元函数微分学 4. 线性代数高级 5. 概率论 6. 最优化 |
| 第04周 线性回归算法                      | 1. 多元线性回归 2. 推导MSE损失函数 3. 开发环境安装与配置 4. 梯度下降法 5. 代码实战三种梯度下降 |
| 第05周 线性回归优化                      | 1. 归一化 2. 正则化 3. Lasso(套索)回归_Ridge回归 4. 多项式回归 5. 实战保险花销预测 |
| 第06周 逻辑回归 Softmax回归                  | 1. 逻辑回归 2. 推导交叉熵损失函数 3. 绘制逻辑回归损失函数 4. Softmax回归 5. 实战音乐分类器 |
| 第07周 SVM支持向量机                     | 1. SVM支持向量机算法 2. 软间隔、硬间隔、非线性SVM 3. SMO优化算法 4. 合页损失函数 5. One-vs-Rest和One-vs-One做多分类 |
| 第08周 无监督学习算法                     | 1. KMeans聚类算法 2. EM最大期望算法 3. GMM高斯混合模型 4. PCA降维算法 5. SVD奇异值分解 |
| 第09周 决策树 集成学习                    | 1. 决策树算法 2. Bagging与Boosting(提振)思想 3. 随机森林算法 4. AdaBoost算法 5. GBDT算法 |
| 第10周 XGBoost算法 Kaggle实战                 | 1. XGBoost算法 2. 推导出XGBoost的目标函数 3. 实战XGBoost模型训练与交叉验证调参 4. 药店销量预测案例 5. 网页分类案例 6. 评估指标混淆矩阵、ROC曲线、AUC指标 |
| 第11周 海量数据挖掘工具                    | 1. Spark(引发)计算框架基础 2. 掌握shuffle(洗牌)原理 3. Spark(引发)计算框架深入 4. 掌握DAG优化原理 5. Spark(引发)机器学习MLlib 6. 实战股票预测 |
| 第12周 数据挖掘项目                      | 1. 推荐系统流程与架构 2. 隐式用户反馈 3. 协同过滤算法 4. HQL语句数据预处理 5. Spark(引发) MLlib模型训练评估 6. 推荐系统模型上线使用 |
| 第13周 概率图模型算法                     | 1. 贝叶斯分类 2. HMM隐含马尔可夫模型 3. Viterbi维特比算法 4. NLP序列标注任务和主要方法 5. CRF条件随机场算法 |
| 第14周 深度学习原理 TensorFlow深度学习工具          | 1. 神经网络算法 2. TensorFlow的GPU版本的安装配置 3. TensorFlow实现多元线性回归算法 4. TensorFlow实现Softmax回归分类 5. TensorFlow实现DNN分类MNIST手写数字识别 |
| 第15周 深度学习进阶                      | 1. 反向传播推导 2. 梯度消失和梯度爆炸 3. Python代码实现神经网络算法 4. Dropout(辍学)防止过拟合 5. Image(图像) Argument(论点)数据增强 6. Xavier和he参数初始化 7. BatchNormalization |
| 第16周 卷积神经网络与优化                   | 1. 感受野 2. 图片卷积的计算 3. 权值共享 4. 池化 5. 经典的CNN卷积神经网络架构 6. 连续使用小的卷积核好处 7. 1*1卷积核的作用和好处 |
| 第17周 经典卷积网络算法                    | 1. VGG16 2. InceptionV3 3. Resnet残差网络 4. DenseNet 5. Mobilenet |
| 第18周 目标检测与FasterRCNN                  | 1. OpenCV工具进行目标检测 2. IoU以及python代码实现 3. NMS非极大值抑制和python代码实现 4. ROI Pooling(池)空间金字塔池化 5. RPN网络 6. FasterRCNN论文详解 |
| 第19周 目标检测之Yolo上采样卷积                | 1. Yolo算法原理及损失函数 2. yoloV3代码实现 3. Darknet工具 4. 上采样的作用和实现 5. 转置卷积 6. 双线性插值 7. ROI Align(齐) 8. FPN特征金字塔网络 |
| 第20周 目标检测项目 图像风格迁移               | 1. 车牌识别项目 2. 自然场景下的目标检测 3. 图片标注工具使用 4. 口罩配戴检测项目 5. GAN对抗生成网络 6. 图像风格迁移项目 |
| 第21周 人脸识别项目                      | 1. MTCNN论文详解 2. FaceNet论文详解 3. Triple(三重) loss(损失)三元组损失 4. 人脸识别项目 |
| 第22周 实例分割项目                      | 1. FCN全卷积网络 2. U-Net(网)语义分割网络 3. 医疗图像语义分割项目 4. MaskRCNN论文详解 5. 蒙版弹幕实例分割项目 |
| 第23周 词向量与词嵌入 循环神经网络原理与优化         | 1. CBOW模型和分层Softmax 2. Skip(史基普)-gram(克)模型和负采样 3. 词向量模型代码实现 4. RNN循环神经网络 5. LSTM长短时记忆 6. 双向LSTM |
| 第24周 文本分类 序列标注                   | 1. 情感分析项目 2. AI写唐诗项目 3. MultiRNNCell 4. NER命名实体识别项目 5. BiLSTM+CRF架构 |
| 第25周 从Attention(注意)到Transformer(变压器)         | 1. Seq2Seq模型 2. Attention(注意)注意力机制 3. Self(自我)-Attention(注意) 4. Multi-head 5. Transformer(变压器) |
| 第26周 NLP之Google神器BERT NLP之百度神器ERNIE NLP之OpenAI神器GPT | 1. ELMO 2. BERT 3. BERT新闻分类项目 4. ERNIE和GPT 5. GPT2训练闲聊机器人 |',6)
